# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PathReinforcement..::..Create Method
PathReinforcement Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, Element, IList<(Of <<'(Curve>)>>), Boolean, ElementId, ElementId, ElementId, ElementId) | Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape. |
| Create(Document, Element, IList<(Of <<'(Curve>)>>), Boolean, ElementId, ElementId, ElementId, ElementId, ElementId) | Creates a new PathReinforcement object from an array of curves and given Rebar Shape id. |

# See Also
PathReinforcement Class
PathReinforcement Members
Autodesk.Revit.DB.Structure Namespace